Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-MC_DFP/1.2.52/PIC32CM6408MC00032/edc/PIC32CM6408MC00032.PIC
      <edc:DCRDef edc:_addr="0x804004" edc:access="nnnnnnnnnnnnnnnn------nnnnnnnnnn" edc:cname="USER_WORD_1" edc:default="0xFFFFFFFF" edc:factorydefault="0xFFFFFFFF" edc:impl="0xFFFF03FF" edc:nzwidth="0x20" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" ltx:memberofperipheral="FUSES">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="WDT_WINDOW" edc:desc="WDT Window" edc:nzwidth="0x4">
              <edc:DCRFieldSemantic edc:cname="CYC8" edc:desc="8 clock cycles" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="CYC16" edc:desc="16 clock cycles" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CYC32" edc:desc="32 clock cycles" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="CYC64" edc:desc="64 clock cycles" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="CYC128" edc:desc="128 clock cycles" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="CYC256" edc:desc="256 clock cycles" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="CYC512" edc:desc="512 clock cycles" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="CYC1024" edc:desc="1024 clock cycles" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="CYC2048" edc:desc="2048 clock cycles" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="CYC4096" edc:desc="4096 clock cycles" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="CYC8192" edc:desc="8192 clock cycles" edc:when="(field &amp; 0xF) == 0xA"/>
              <edc:DCRFieldSemantic edc:cname="CYC16384" edc:desc="16384 clock cycles" edc:when="(field &amp; 0xF) == 0xB"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDT_EWOFFSET" edc:desc="WDT Early Warning Offset" edc:nzwidth="0x4">
              <edc:DCRFieldSemantic edc:cname="CYC8" edc:desc="8 clock cycles" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="CYC16" edc:desc="16 clock cycles" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CYC32" edc:desc="32 clock cycles" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="CYC64" edc:desc="64 clock cycles" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="CYC128" edc:desc="128 clock cycles" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="CYC256" edc:desc="256 clock cycles" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="CYC512" edc:desc="512 clock cycles" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="CYC1024" edc:desc="1024 clock cycles" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="CYC2048" edc:desc="2048 clock cycles" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="CYC4096" edc:desc="4096 clock cycles" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="CYC8192" edc:desc="8192 clock cycles" edc:when="(field &amp; 0xF) == 0xA"/>
              <edc:DCRFieldSemantic edc:cname="CYC16384" edc:desc="16384 clock cycles" edc:when="(field &amp; 0xF) == 0xB"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDT_WEN" edc:desc="WDT Window Mode Enable" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="DISABLED" edc:desc="WDT is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ENABLED" edc:desc="WDT is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BODVDD_HYST" edc:desc="BODVDD Hysterisis" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="DISABLED" edc:desc="No Hysteresis" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ENABLED" edc:desc="Hysteresis Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:DCRFieldDef edc:cname="NVMCTRL_REGION_LOCKS" edc:desc="NVM Region lock bits" edc:nzwidth="0x10"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
    <edc:UserIDSector atdf:pagesize="0x40" edc:beginaddr="0x804008" edc:endaddr="0x804100" edc:regionid="userid"/>
    <edc:CodeSector atdf:pagesize="0x40" edc:beginaddr="0x400000" edc:endaddr="0x400800" edc:regionid="DATAFLASH" edc:rw="rw"/>
    <edc:GPRDataSector edc:beginaddr="0x20000000" edc:endaddr="0x20002000" edc:isexecutable="true" edc:regionid="HSRAM" edc:rw="rw"/>
    <edc:SFRDataSector edc:beginaddr="0x40000000" edc:endaddr="0x40004000" edc:regionid="HPB0" edc:rw="rw"/>
    <edc:SFRDataSector edc:beginaddr="0x41000000" edc:endaddr="0x41010000" edc:regionid="HPB1" edc:rw="rw"/>
    <edc:SFRDataSector edc:beginaddr="0x42000000" edc:endaddr="0x42008000" edc:regionid="HPB2" edc:rw="rw"/>
    <edc:SFRDataSector edc:beginaddr="0x48000000" edc:endaddr="0x48000020" edc:regionid="DIVAS" edc:rw="rw"/>
    <edc:SFRDataSector edc:beginaddr="0xE0000000" edc:endaddr="0xE000EDA4" edc:regionid="PPB" edc:rw="rw">
      <edc:AdjustPoint edc:_addr="0xE0000000" edc:offset="0xE004"/>
      <edc:SFRDef edc:_addr="0xE000E004" edc:access="----------------------------rrrr" edc:cname="ICTR" edc:desc="Interrupt Controller Type Register" edc:impl="0xF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INTLINESNUM" edc:desc="Number of interrupt lines supported by NVIC in granularities of 32." edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE000E008" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0xE000E010" edc:access="---------------n-------------nnn" edc:cname="CSR" edc:impl="0x10007" edc:mclr="00000000000000000000000000000100" edc:nzwidth="0x20" edc:por="00000000000000000000000000000100" ltx:memberofperipheral="SysTick">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SysTick">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="SysTick Counter Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="Counter disabled" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="Counter enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TICKINT" edc:desc="SysTick Exception Request Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="Counting down to 0 does not assert the SysTick exception request" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="Counting down to 0 asserts the SysTick exception request" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CLKSOURCE" edc:desc="Clock Source 0=external, 1=processor" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="External clock" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="Processor clock" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="COUNTFLAG" edc:desc="Timer counted to 0 since last read of register" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E014" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="RVR" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="SysTick">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SysTick">
            <edc:SFRFieldDef edc:cname="RELOAD" edc:desc="Value to load into the SysTick Current Value Register when the counter reaches 0" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
