Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-MC_DFP/1.2.52/PIC32CM6408MC00032/edc/PIC32CM6408MC00032.PIC
      <edc:SFRDef edc:_addr="0x41002008" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:cname="LENGTH" edc:impl="0xFFFFFFFC" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LENGTH" edc:desc="Length" edc:nzwidth="0x1E"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100200C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DATA" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41002010" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DCC0" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41002014" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DCC1" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41002018" edc:access="rrrrrrrrr-rrrrrrrrrrrrrrrrrrrrrr" edc:cname="DID" edc:impl="0xFFBFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="DEVSEL" edc:desc="Device Select" edc:nzwidth="0x8">
              <edc:SFRFieldSemantic edc:cname="128KB_16KB_32PIN" edc:desc="128 KB Flash / 16 KB SRAM / 32-pin" edc:when="(field &amp; 0xFF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="64KB_8KB_32PIN" edc:desc="64 KB Flash / 8 KB SRAM / 32-pin" edc:when="(field &amp; 0xFF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="128KB_16KB_48PIN_CAN" edc:desc="128 KB Flash / 16 KB SRAM / 48-pin" edc:when="(field &amp; 0xFF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="64KB_8KB_48PIN_CAN" edc:desc="64 KB Flash / 8 KB SRAM / 48-pin" edc:when="(field &amp; 0xFF) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="REVISION" edc:desc="Revision Number" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="DIE" edc:desc="Die Number" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SERIES" edc:desc="Series" edc:nzwidth="0x6">
              <edc:SFRFieldSemantic edc:cname="MC00" edc:desc="PIC32CM MC00" edc:when="(field &amp; 0x3F) == 6"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FAMILY" edc:desc="Family" edc:nzwidth="0x5">
              <edc:SFRFieldSemantic edc:cname="2" edc:desc="5V Industrial" edc:when="(field &amp; 0x1F) == 2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PROCESSOR" edc:desc="Processor" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="1" edc:desc="Cortex-M0+" edc:when="(field &amp; 0xF) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4100201C" edc:offset="0xD4"/>
      <edc:SFRDef edc:_addr="0x410020F0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DCFG0" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="DCFG" edc:desc="Device Configuration" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410020F4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DCFG1" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="DCFG" edc:desc="Device Configuration" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x410020F8" edc:offset="0xF08"/>
      <edc:SFRDef edc:_addr="0x41003000" edc:access="rrrrrrrrrrrrrrrrrrrr----------rr" edc:cname="ENTRY0" edc:impl="0xFFFFF003" edc:mclr="10011111000011111100000000000010" edc:nzwidth="0x20" edc:por="10011111000011111100000000000010" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="EPRES" edc:desc="Entry Present" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FMT" edc:desc="Format" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="ADDOFF" edc:desc="Address Offset" edc:nzwidth="0x14"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41003004" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="ENTRY1" edc:mclr="00000000000000000101000000000010" edc:nzwidth="0x20" edc:por="00000000000000000101000000000010" ltx:memberofperipheral="DSU"/>
      <edc:SFRDef edc:_addr="0x41003008" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="END" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="END" edc:desc="End Marker" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4100300C" edc:offset="0xFC0"/>
      <edc:SFRDef edc:_addr="0x41003FCC" edc:access="-------------------------------r" edc:cname="MEMTYPE" edc:impl="0x1" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="SMEMP" edc:desc="System Memory Present" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
